import { AboutFeature } from '../components/HomePage/About/AboutTypes';

export const aboutFeatures: AboutFeature[] = [
  {
    iconId: 'icon-flag',
    title: 'Місія фонду',
    description:
      'Надання всебічної підтримки українським захисникам і членам їхніх родин через координацію волонтерських, громадських та благодійних ініціатив.',
  },
  {
    iconId: 'icon-handshake-o',
    title: 'Напрями діяльності',
    description:
      'Матеріальна допомога, медична реабілітація, психологічна підтримка, юридичний супровід, освітні програми для дітей та родин військовослужбовців.',
  },
  {
    iconId: 'icon-star-half',
    title: 'Гарантії прозорості',
    description:
      'Відкрита фінансова звітність. Кожна гривня враховується та використовується виключно на потреби захисників. Регулярні звіти публікуються для донорів і партнерів.',
  },
];
