import { HelpStepItem } from '../components/HelpPage/HelpStep/HelpStepTypes';

export const helpSteps: HelpStepItem[] = [
  {
    number: 1,
    title: 'Подача заявки',
    text: 'Ознайомтеся з програмами підтримки нижче на сторінці та заповніть форму або зверніться до відділення фонду з документами, що підтверджують ваш статус.',
  },
  {
    number: 2,
    title: 'Перевірка даних',
    text: 'Наші фахівці перевірять ваші дані через бази Міністерства оборони впродовж трьох робочих днів і зв’яжуться з вами для уточнення деталей.',
  },
  {
    number: 3,
    title: 'Отримання допомоги',
    text: 'Після підтвердження статусу ви отримаєте індивідуальний план підтримки та доступ до всіх програм фонду.',
  },
];
